app/Controllers/Admin/ProjectController.php

    public function projelist()
    {
        $model = new ProjectModel();
        $data['projects'] = $model->findAll(); // Tüm projeleri çek
---
SELECT *
FROM `project`

    public function projectdetay($project_id)
    {
        $projectModel       = new ProjectModel();
        $formDataModel      = new \App\Models\FormDataModel();
        $templateFieldModel = new \App\Models\FormDataModel();
        $processModel       = new \App\Models\ProjectsProcessesModel();
        $authModel          = new \App\Models\RoleModel();
        $config             = new \Config\Processes();

        // Proje verisi
        $project = $projectModel->find($project_id);
        if (!$project) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Proje bulunamadı.');
        }

        // Aktif şablon kontrolü
        $activeTemplateCode = env('APP_TEMPLATE', 'default');
        if ($project['template_code'] !== $activeTemplateCode) {
            echo "Proje yanlış şablona bağlı. Beklenen: {$activeTemplateCode}";
            return;
        }

        // Form verisi ve şablon kontrolü
        $formData       = $formDataModel->where('project_id', $project_id)->findAll();
        $templateFields = $templateFieldModel->where('template_code', $project['template_code'])->findAll();
---
SELECT *
FROM `project`
WHERE `project`.`project_id` = '12'
SELECT *
FROM `form_data`
WHERE `project_id` = '12'
SELECT *
FROM `form_data`
WHERE `template_code` = 'default'

    public function handleApplicationProcess($project_id)
    {
        //$project_id = EncryptHelper::decrypt($project_id);


        if (!$project_id) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Geçersiz başvuru ID'
            ]);
        }

        $processCode = $this->request->getPost('process_code');
        $actionCode = $this->request->getPost('action_code');

        $bookModel = new ProjectModel();
        $user = $bookModel->where('project_id', $project_id)->first();
---
SELECT *
FROM `project`
WHERE `project_id` = '12'
 LIMIT 1