app/Controllers/User/ProjectController.php

        ];

        // Projeyi kaydet
        $projectId = $model->insert($data);
---
INSERT INTO `project` (`user_id`, `project_name`, `unit`, `location`, `subject`, `subject_other`, `institutions`, `target_audience`, `purpose`, `topic`, `summary`, `activity_description`, `expected_results`, `why_implement`, `documentation`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES ('29', 'deniyorum canım', 'dsadssa', 'dsadsasad', 'Diğer', 'aile hayat insan ', 'Özel Sektör Kuruluşları', 'Kadın Girişimciler', 'başarı', 'başarı', 'başarı', 'başarı', 'başarı', 'başarı', '1750623116_44038c1f53cafb9e45ba.docx', '2025-06-22', '2025-06-22', '2025-06-22 20:11:56', '2025-06-22 20:11:56')


        foreach ($formValues as $name => $meta) {
            $value = $this->request->getPost($name);
            $formDataModel->insert([
                'project_id'    => $projectId,
                'name'          => $name,
                'type'          => $meta['type'],
                'value'         => $value,
                'template_code' => $templateCode,
            ]);
        }

        if ($fileName) {
            $formDataModel->insert([
                'project_id'    => $projectId,
                'name'          => 'file',
                'type'          => 'file',
                'value'         => $fileName,
                'template_code' => $templateCode,
            ]);
---
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES (12, 'project_name', 'text', 'deniyorum canım', 'default', '2025-06-22 20:11:56', '2025-06-22 20:11:56')
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES (12, 'file', 'file', '1750623116_44038c1f53cafb9e45ba.docx', 'default', '2025-06-22 20:11:56', '2025-06-22 20:11:56')

                ];
                $editorModel->insert($editorData);

                $formDataModel->insert([
                    'project_id'    => $projectId,
                    'name'          => "editor_name_$index",
                    'type'          => 'text',
                    'value'         => $names[$index] ?? '',
                    'template_code' => $templateCode,
                ]);
                $formDataModel->insert([
                    'project_id'    => $projectId,
                    'name'          => "editor_email_$index",
                    'type'          => 'text',
                    'value'         => $email,
                    'template_code' => $templateCode,
                ]);
---
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES (12, 'editor_email_0', 'text', 'aysegul@gmail.com', 'default', '2025-06-22 20:11:56', '2025-06-22 20:11:56')
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES (12, 'editor_appellation_0', 'text', 'Öğr.Gör.Dr.', 'default', '2025-06-22 20:11:56', '2025-06-22 20:11:56')

    public function edit($id)
{
    $model = new ProjectModel();
    $project = $model->find($id);
    if (!$project) {
        throw new \CodeIgniter\Exceptions\PageNotFoundException('Proje bulunamadı.');
    }

    $editorModel = new ProjectEditorModel();
    $editors = $editorModel->where('project_id', $id)->findAll();
---
SELECT *
FROM `project`
WHERE `project`.`project_id` = '2'
SELECT *
FROM `project_editors`
WHERE `project_id` = '2'

    }

    // Projeyi güncelle
    $updated = $model->update($projectId, $data);
---
UPDATE `project` SET `user_id` = '9', `project_name` = 'test iki', `unit` = 'asdads', `location` = 'adsdsa', `subject` = 'Eğitim', `subject_other` = '', `institutions` = '', `target_audience` = '', `purpose` = 'daasdsad', `topic` = 'bhjjkhj', `summary` = 'bhjnkm', `activity_description` = 'jnbjnjkbnj', `expected_results` = 'jsdjdsajls', `why_implement` = 'jadsjdsanjdsa', `start_date` = '2025-06-30', `end_date` = '2025-06-30', `updated_at` = '2025-06-29 23:27:13'
WHERE `project`.`project_id` IN ('2')

    }

    // Önce eski form_data kayıtlarını sil (proje_id ve template_code bazlı)
    $formDataModel->where('project_id', $projectId)->where('template_code', $templateCode)->delete();
---
DELETE FROM `form_data`
WHERE `project_id` = '2'
AND `template_code` = 'default'


    foreach ($formValues as $name => $meta) {
        $value = $this->request->getPost($name);
        $formDataModel->insert([
            'project_id'    => $projectId,
            'name'          => $name,
            'type'          => $meta['type'],
            'value'         => $value,
            'template_code' => $templateCode,
        ]);
---
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES ('2', 'project_name', 'text', 'test iki', 'default', '2025-06-29 23:27:13', '2025-06-29 23:27:13')

            ];
            $editorModel->insert($editorData);

            $formDataModel->insert([
                'project_id'    => $projectId,
                'name'          => "editor_name_$index",
                'type'          => 'text',
                'value'         => $names[$index] ?? '',
                'template_code' => $templateCode,
            ]);
            $formDataModel->insert([
                'project_id'    => $projectId,
                'name'          => "editor_email_$index",
                'type'          => 'text',
                'value'         => $email,
                'template_code' => $templateCode,
            ]);
            $formDataModel->insert([
                'project_id'    => $projectId,
                'name'          => "editor_appellation_$index",
                'type'          => 'text',
                'value'         => $appellations[$index] ?? '',
                'template_code' => $templateCode,
            ]);
---
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES ('2', 'editor_name_0', 'text', 'emreadasd', 'default', '2025-06-29 23:27:13', '2025-06-29 23:27:13')
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES ('2', 'editor_email_0', 'text', 'emre@gmail.com', 'default', '2025-06-29 23:27:13', '2025-06-29 23:27:13')
INSERT INTO `form_data` (`project_id`, `name`, `type`, `value`, `template_code`, `created_at`, `updated_at`) VALUES ('2', 'editor_appellation_0', 'text', 'Dr.Öğr.Üyesi', 'default', '2025-06-29 23:27:13', '2025-06-29 23:27:13')

    public function projectdetay($project_id)
    {
        $projectModel       = new ProjectModel();
        $formDataModel      = new \App\Models\FormDataModel();
        $templateFieldModel = new \App\Models\FormDataModel();
        $processModel       = new \App\Models\ProjectsProcessesModel();
        $authModel          = new \App\Models\RoleModel();
        $config             = new \Config\Processes();

        // Proje verisi
        $project = $projectModel->find($project_id);
        if (!$project) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Proje bulunamadı.');
        }

        // Aktif şablon kontrolü
        $activeTemplateCode = env('APP_TEMPLATE', 'default');
        if ($project['template_code'] !== $activeTemplateCode) {
            echo "Proje yanlış şablona bağlı. Beklenen: {$activeTemplateCode}";
            return;
        }

        // Form verisi ve şablon kontrolü
        $formData       = $formDataModel->where('project_id', $project_id)->findAll();
        $templateFields = $templateFieldModel->where('template_code', $project['template_code'])->findAll();
---
SELECT *
FROM `project`
WHERE `project`.`project_id` = '2'
SELECT *
FROM `form_data`
WHERE `project_id` = '2'
SELECT *
FROM `form_data`
WHERE `template_code` = 'default'