app/Controllers/User/UserController.php

    public function projelerimlist()
    {
        $userID = session()->get('user_id'); // Oturumdan kullanıcı ID'sini al

        $model = new ProjectModel();
        $data['projects'] = $model->where('user_id', $userID)->findAll(); // Sadece giriş yapan kullanıcının projelerini çek
---
SELECT *
FROM `project`
WHERE `user_id` = '9'