app/Models/user/ProjectModel.php

    public function getMembersByProjectId($projectId)
    {
        return $this->db->table('project_editors')
            ->where('project_id', $projectId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `project_editors`
WHERE `project_id` = '12'

    public function getFilesByProjectId($projectId)
    {
        return $this->db->table('project')
            ->where('project_id', $projectId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `project`
WHERE `project_id` = '12'