app/Models/LoginModel.php

SELECT `user_roles`.`role_id`, `roles`.`role_name`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '27'
---
    public function getUserRoleIn($userId)
    {
        return $this->db->table('user_roles')
            ->select('user_roles.role_id, roles.role_name')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->where('user_roles.user_id', $userId)
            ->get()
            ->getRowArray();