app/Models/ProjectProcessesValueModel.php

    public function customInsert($data)
    {
        return $this->insert($data);
---
INSERT INTO `project_processes_value` (`project_id`, `processes_value`, `user_id`, `admin_id`, `file_path`, `created_at`, `updated_at`) VALUES ('12', 'duzeltilmeli', '29', '27', NULL, '2025-06-22 20:15:23', '2025-06-22 20:15:23')