app/Models/RoleModel.php

SELECT *
FROM `roles`
WHERE `id` = '27'
 LIMIT 1
---
    public function getRoleIdByUserId($userId)
    {
        $result = $this->where('id', $userId)->first();